In [2]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

In [3]:
%%sql 
DROP TABLE IF EXISTS students;

 * postgresql://user:***@localhost:5432/postgres
Done.

[]

### 1. Create a table called students with the following columns:

student_id | name    | age | major

-----------+---------+-----+-----------------

1          | Alice   | 20  | Computer Science

2          | Bob     | 22  | Economics

3          | Charlie | 19  | Chemistry

4          | Diana   | 22  | Computer Science

5          | Eve     | 18  | NULL

In [20]:
%%sql

CREATE TABLE students(
    student_id INT PRIMARY KEY,
    name VARCHAR(10) NOT NULL,
    age INT,
    major VARCHAR(30)
);

 * postgresql://user:***@localhost:5432/postgres
Done.

[]

In [21]:
%%sql 
INSERT INTO students(student_id, name, age, major)
VALUES(1, 'Alice', 20, 'Computer Science'),
(2, 'Bob', 22, 'Economics'),
(3, 'Charlie', 19, 'Chemistry'),
(4, 'Diana', 21, 'Computer Science'),
(5, 'Eve', 18, NULL),
(6, 'Mark', 25, 'History');

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[]

In [6]:
%%sql 
SELECT * FROM students;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]

### 2. Select all student names and ages.

In [7]:
%%sql
SELECT name, age FROM students;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]

### 3. Select the students whose age is greater than 20.

In [8]:
%%sql
SELECT name FROM students
WHERE age > 20;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]

### 4. Select the name and age of each student, but rename the age column as years_old.

In [9]:
%%sql 
SELECT name, age as years_old FROM students;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]

### Now rename the column permanently

In [10]:
%%sql
ALTER TABLE students
RENAME COLUMN age TO years_old;

 * postgresql://user:***@localhost:5432/postgres
Done.

[]

In [11]:
%%sql 
SELECT name, years_old FROM students;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]

### 5. Get the list of unique majors (no duplicates).

In [12]:
%%sql 
SELECT DISTINCT(major) FROM students;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]

### 6. Count how many students are in each major.

In [13]:
%%sql 
SELECT major, COUNT(name) FROM students
GROUP BY major;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]

### 7. Display the table ordered by age ascending.

In [14]:
%%sql
SELECT * FROM students
ORDER BY years_old ASC;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]

### 8. Display the students ordered by age descending, showing only name and age.

In [15]:
%%sql
SELECT name, years_old FROM students
ORDER BY years_old DESC;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]

### 9. Get the average age of students grouped by major.

In [16]:
%%sql
SELECT major, ROUND(AVG(years_old),2) as average
FROM students
GROUP BY major;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]

### 10. Show only the majors that have more than 1 student.

In [17]:
%%sql
SELECT major, COUNT(*) AS student_count FROM students
GROUP BY major
HAVING COUNT(*) > 1;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]

### 11. Display all students ordered first by major (alphabetically) and then by age (descending).

In [18]:
%%sql 
SELECT * FROM students
ORDER BY major ASC, years_old DESC;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]